
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ВКМ 01.02.2025 Добавление
Процедура ВКМ_ВыполнитьАвтозаполнение() Экспорт
	
	НоменклатураАбонентскаяПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
	НоменклатураРаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
	
	// Проверяем заполнение констант
    Если НЕ ЗначениеЗаполнено(НоменклатураАбонентскаяПлата) ИЛИ НЕ ЗначениеЗаполнено(НоменклатураРаботыСпециалиста) Тогда
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Не заполнены константы НоменклатураАбонентскаяПлата или НоменклатураРаботыСпециалиста.";
        Сообщение.Сообщить();
        Возврат;
	КонецЕсли;
	
	Товары.Очистить();
	Услуги.Очистить();
	
	//Получаем сумму абонентской платы из договора
	СуммаАбонентскойПлаты = Договор.ВКМ_АбонентскаяПлата;
	
	// Проверяем, что сумма абонентской платы ненулевая
	Если СуммаАбонентскойПлаты > 0 Тогда
	    НоваяСтрока = Товары.Добавить();
	    НоваяСтрока.Номенклатура = НоменклатураАбонентскаяПлата;
	    НоваяСтрока.Количество = 1;
	    НоваяСтрока.Цена = СуммаАбонентскойПлаты;
	    НоваяСтрока.Сумма = СуммаАбонентскойПлаты; 
	КонецЕсли;
		   
    // Получаем данные из регистра ВыполненныеКлиентуРаботы
    Запрос = Новый Запрос;
    Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	СУММА(ВКМ_ВыполненныеКлиентуРаботы.КоличествоЧасов) КАК Количество,
	 |	СУММА(ВКМ_ВыполненныеКлиентуРаботы.СуммаКОплате) КАК Сумма
	 |ИЗ
	 |	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы КАК ВКМ_ВыполненныеКлиентуРаботы
	 |ГДЕ
	 |	ВКМ_ВыполненныеКлиентуРаботы.Период МЕЖДУ &НачалоПериода И &КонецПериода
	 |	И ВКМ_ВыполненныеКлиентуРаботы.Договор.ВидДоговора = &АбонентскоеОбслуживание";
    
    Запрос.УстановитьПараметр("АбонентскоеОбслуживание", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
    Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
    
    Выборка = Запрос.Выполнить().Выбрать();
	
    Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Количество) И Выборка.Количество > 0 ИЛИ ЗначениеЗаполнено(Выборка.Сумма) И Выборка.Сумма > 0 Тогда
            НоваяСтрока = Услуги.Добавить();
            НоваяСтрока.Номенклатура = НоменклатураРаботыСпециалиста;
            НоваяСтрока.Количество = Выборка.Количество;
			НоваяСтрока.Цена = Выборка.Сумма / Выборка.Количество;
            НоваяСтрока.Сумма = Выборка.Сумма;
		КонецЕсли;
	КонецЦикла; 
		
    СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");	
	
КонецПроцедуры
// ВКМ Конец добавления


Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.Организация КАК Организация,
	               |	ЗаказПокупателя.Контрагент КАК Контрагент,
	               |	ЗаказПокупателя.Договор КАК Договор,
	               |	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	               |	ЗаказПокупателя.Товары.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Товары,
	               |	ЗаказПокупателя.Услуги.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Услуги
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;
	
	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Движение = Движения.ОбработкаЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Заказ = Основание;
	Движение.СуммаОтгрузки = СуммаДокумента;

	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
