#Область ПрограммныйИнтерфейс

Функция ОбработатьВходящийЗапрос(Текст) Экспорт 
	
	Результат = Ложь;
	
	Попытка
		ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
		Токен = Константы.ВКМ_ТокенТГБот.Получить();
		Чат = Константы.ВКМ_ИдентификаторГруппыТГ.Получить();
		Ресурс = "bot" + Токен + "/sendMessage?";
		Соединение = Новый HTTPСоединение("api.telegram.org",443,,,,,ЗащищенноеСоединение);
		HTTPЗапрос = Новый HTTPЗапрос(Ресурс);
		HTTPЗапрос.Заголовки.Вставить("Content-Type",ТипКонтентаJSON());
		
		Данные = Новый Структура;
		Данные.Вставить("chat_id", Чат);
		Данные.Вставить("text", Текст);
		СтрокаJSON = СтрокаJSON(Данные);
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON);
		
		Ответ = Соединение.Получить(HTTPЗапрос);  
		Если Ответ.КодСостояния=200 Тогда
			Результат = Истина;
		КонецЕсли;
		
	Исключение   
		ЗаписьЖурналаРегистрации("HTTPСервисы.Ошибка", УровеньЖурналаРегистрации.Ошибка,,,
		ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтрокаJSON(ОбъектJSON)

    ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(, Символы.Таб);

    Запись = Новый ЗаписьJSON;
    Запись.УстановитьСтроку(ПараметрыЗаписи);
    ЗаписатьJSON(Запись, ОбъектJSON);

    Возврат Запись.Закрыть();

КонецФункции 

Функция ТипКонтентаJSON()
    Возврат "application/json";
КонецФункции

#КонецОбласти

