#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
    // ВКМ 25.01.2025 Добавление реквизитов
    ДобавляемыеРеквизиты = Новый Массив;
	
	ДобавитьРеквизит_ВКМ(ДобавляемыеРеквизиты, "ВКМ_ПериодС", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ДобавитьРеквизит_ВКМ(ДобавляемыеРеквизиты, "ВКМ_ПериодПо", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ДобавитьРеквизит_ВКМ(ДобавляемыеРеквизиты, "ВКМ_СтоимостьЧасаРаботы", ОбщегоНазначения.ОписаниеТипаЧисло(10,0));
	ДобавитьРеквизит_ВКМ(ДобавляемыеРеквизиты, "ВКМ_ВКМ_АбонентскаяПлата", ОбщегоНазначения.ОписаниеТипаЧисло(10,0));
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты); 
	
	Группа = Элементы.Добавить("ГруппаПараметрыДоговора", Тип("ГруппаФормы"), ЭтотОбъект);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Группа.ОтображатьЗаголовок = Ложь;
	Группа.Отображение = ОтображениеОбычнойГруппы.Нет;

	ДобавитьПолеРеквизита("ВКМ_ПериодС", Группа);
	ДобавитьПолеРеквизита("ВКМ_ПериодПо", Группа);
	ДобавитьПолеРеквизита("ВКМ_СтоимостьЧасаРаботы", Группа);
	ДобавитьПолеРеквизита("ВКМ_АбонентскаяПлата", Группа);
	
	ОпределитьВидимостьЭлементов();
	// ВКМ Конец добавления
   	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	// ВКМ 25.01.2025 добавление
	ОпределитьВидимостьЭлементов();
	// ВКМ Конец добавления
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьРеквизит_ВКМ(ДобавляемыеРеквизиты, ВКМ_Реквизит, ТипРеквизита)
	
	// ВКМ 25.01.2025 добавление
	ИмяРеквизита = ИмяРеквизита(ВКМ_Реквизит);		
			
	Реквизит = Новый РеквизитФормы(ИмяРеквизита, 
		ТипРеквизита,,
		ВКМ_Реквизит,
		Истина);
		
	ДобавляемыеРеквизиты.Добавить(Реквизит);
	// ВКМ Конец добавления 
	
КонецПроцедуры

&НаСервере
Функция ИмяРеквизита(ВКМ_Реквизит)
	
	// ВКМ 25.01.2025
	Шаблон = "%1_%2";
	
	ПредставлениеИдентификатора = СтрЗаменить(Объект.Ссылка.УникальныйИдентификатор(), "-", "");
	
	Возврат СтрШаблон(Шаблон, ВКМ_Реквизит, ПредставлениеИдентификатора);
	// ВКМ Конец добавления
	
КонецФункции

&НаСервере
Процедура ДобавитьПолеРеквизита(ВКМ_Реквизит, Группа)
	
	// ВКМ 25.01.2025 добавление
	ИмяРеквизита = ИмяРеквизита(ВКМ_Реквизит);
	
	Элемент = Элементы.Добавить(ИмяРеквизита, Тип("ПолеФормы"), Группа);
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = "Объект."+ВКМ_Реквизит;
	Элемент.Заголовок = СтрЗаменить(ВКМ_Реквизит, "ВКМ_", "");
	// ВКМ Конец добавления
	
КонецПроцедуры


&НаСервере
Процедура ОпределитьВидимостьЭлементов()

	//ВКМ 25.01.2025 добавление
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		Элементы.ГруппаПараметрыДоговора.Видимость = Истина;
	Иначе
		Элементы.ГруппаПараметрыДоговора.Видимость = Ложь;
	КонецЕсли;		 
    // ВКМ Конец добавления

КонецПроцедуры

#КонецОбласти





