#Область СлужебныеПроцедурыИФункции

Процедура ОтправитьСообщениеВТелеграм() Экспорт
	
	Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |    ВКМ_УведомленияТГБот.Ссылка КАК Ссылка,
        |    ВКМ_УведомленияТГБот.ТекстСообщения КАК ТекстСообщения
        |ИЗ
        |    Справочник.ВКМ_УведомленияТГБот КАК ВКМ_УведомленияТГБот";


	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Результат = ВКМ_ИнтеграцияТГ.ОбработатьВходящийЗапрос(ВыборкаДетальныеЗаписи.ТекстСообщения);
		Если Результат Тогда
			СпрОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			СпрОбъект.Удалить();
		Иначе
			ЗаписьЖурналаРегистрации("HTTPСервисы.Ошибка", УровеньЖурналаРегистрации.Ошибка,,,
			"Данные не отправлены");
		КонецЕсли;
		
	КонецЦикла;

    
КонецПроцедуры

#КонецОбласти

