#Область  ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда) 

	ДанныеДоговоровДляЗаполнения = Новый Структура;
	ДанныеДоговоровДляЗаполнения.Вставить("Период", Объект.Период);
	
	СтруктураФоновогоЗадания = ВыполнитьФоновоеЗаданиеНаСервере(ДанныеДоговоровДляЗаполнения, УникальныйИдентификатор);
	
	ПараметрыОжидания  = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.Интервал = 1;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(СтруктураФоновогоЗадания, Новый ОписаниеОповещения("ОбработатьРезультат", ЭтотОбъект), ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти 


#Область ОбработчикиСобытийЭлементовШапкиФормы 

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Объект.Период = НачалоМесяца(Объект.Период);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	
&НаСервере	
Функция ВыполнитьФоновоеЗаданиеНаСервере(ПараметрыЗапуска, УникальныйИдентификатор)
	
	НаименованиеЗадания = "Создание реализаций";
	ВыполняемыйМетод = "Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьДокументыРту";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьДокументыРту", Объект.Период); 
		
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультат(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	МассивДокументов = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	ДанныеДоговоровДляЗаполнения(МассивДокументов);
	
КонецПроцедуры

&НаСервере
Процедура ДанныеДоговоровДляЗаполнения(МассивДокументов)
	
	Объект.Договоры.Очистить();
	
	Для Каждого Документ из МассивДокументов Цикл
		
		НоваяСтрока = Объект.Договоры.Добавить();
		НоваяСтрока.Договор = Документ.Договор;
		НоваяСтрока.Реализация = Документ;
		
	КонецЦикла
	
КонецПроцедуры

#КонецОбласти 

	